       IDENTIFICATION DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       PROGRAM-ID. PGM50.
      *           LEARN HOW SEARCH WORKS IN COBOL
      *
      *SEARCH IS USED TO SEARCH AN ELEMENT INSIDE A TABLE
      *IT CAN BE USED ONLY ON TABLES DECLARED BY INDEXED PHRASE
      *IT STARTS WITH THE INITIAL VALUE AS 1.
      *IF THE SEARCH ELEMENT IS NOT FOUND THEN THE INDEX IS
      *AUTOMATICALLY INCREMENTED BY 1 UNTIL IT REACHES TO THE END.
      *
       ENVIRONMENT DIVISION.
      *
       CONFIGURATION SECTION.
      *
       INPUT-OUTPUT SECTION.
      *
       DATA DIVISION.
      *
       FILE SECTION.
      *
       WORKING-STORAGE SECTION.
      *
       01 WS-TABLE.
           05 WS-A  PIC X(1) OCCURS 18 TIMES INDEXED BY I.
       01 WS-SEARCH PIC A(1) VALUE "M".
      *
       PROCEDURE DIVISION.
      *
       MAIN-PROCEDURE.
      *SEARCH IS LINEAR . PROGRAMMER WILL INITIALIZE THE VALUE OF
      * I TO A AND COBOL WILL INCREMENT IT UNTIL END.
      *IN COB 85 MORE THAN ONE WHEN CLAUSE CAN BE USED
            MOVE "ABCDEFGHIJKLMNOPQR" TO WS-TABLE
            SET I TO 1
            SEARCH WS-A
               AT END
                 DISPLAY "M NOT FOUND IN THE TABLE"
               WHEN WS-A(I) = WS-SEARCH
                 DISPLAY "LETTER M FOUND " WS-A(I)  "  " I
            END-SEARCH
            STOP RUN.
